Revit 2027 API
RoofComponents.ScaledDepth Property
 The depth of the roof slab.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ScaledDepth { get; }
Public ReadOnly Property ScaledDepth As Double
	Get
public:
property double ScaledDepth {
	double get ();
}
member ScaledDepth : float with get
Property Value
Double
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace